app/views/dogs/show.html.erb

SELECT "toys".* FROM "toys" WHERE "toys"."dog_id" = $1  [["dog_id", 1]]
---
<ul>
    <% @dog.toys.each do |toy| %>