app/controllers/dogs_controller.rb

SELECT "dogs".* FROM "dogs"
---
    def index
        #GET /dogs
        #self.render json: Dog.all
        @dogs = Dog.all

SELECT  "dogs".* FROM "dogs" WHERE "dogs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        #GET /dogs/123
        #self.render json: Dog.find(self.params[:id])
        @dog = Dog.find(params[:id])

INSERT INTO "dogs" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Tigger"], ["created_at", "2020-07-20 17:29:19.748067"], ["updated_at", "2020-07-20 17:29:19.748067"]]
---
    def create
        @dog = Dog.new(self.dog_params)

        if @dog.save

SELECT  "dogs".* FROM "dogs" WHERE "dogs"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "dogs" WHERE "dogs"."id" = $1  [["id", 5]]
---
    def destroy
        @dog = Dog.find(params[:id])
        @dog.destroy