app/controllers/toys_controller.rb

SELECT  "dogs".* FROM "dogs" WHERE "dogs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def index
        #/dogs/dog_id/toys
        dog = Dog.find(params[:dog_id])

SELECT  "toys".* FROM "toys" WHERE "toys"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        #/dogs/:dog_id/toys/:id
        #/toys/:id <<<
        render json: Toy.find(params[:id])